code-review/NRB_3471_3546/База_Было/InformationRegisters/ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОшибкиОнлайнЗагрузкиИзВнешнихИсточников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИВремяОшибки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВнешнийИсточник</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВнешниеИсточники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/CommonModules/Кафка/Ext/Module.bsl
#Область ОбщиеМетодыВзаимодействияKafka

// Помещает отправляемое сообщение в регистр сведений KafkaИсходящий
// для последующей отправки в Kafka
// Параметры:
//  ВнешнийИсточник - ПланыВидовХарактеристик.ВнешниеИсточникиСсылка - идентификатор топика Kafka
//  Ключ - Строка - ключ сообщения
//  Сообщение - Строка - текст сообщения
//  Идентификатор - Строка - необязательный. Можно передавать свой ГУИД.
//  Ссылка - Ссылка - Ссылка объекта, по которому выгружается сообщение
Процедура ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, Ключ, Сообщение, Идентификатор = Неопределено, Ссылка = Неопределено) Экспорт
	
	РегистрыСведений.ЖурналИсходящихСообщенийKafka.Добавить(ВнешнийИсточник, Ключ, Сообщение, Идентификатор, Ссылка);
	
КонецПроцедуры

// Выполняет отправку сообщений из РС KafkaИсходящий
Процедура ВыполнитьОтправкуСообщений() Экспорт
	
	РегистрыСведений.ЖурналИсходящихСообщенийKafka.ОтправитьСообщениеИсходящее();
	
КонецПроцедуры

// Получает сообщение из Kafka, записывает в РС KafkaВхоядищй
// Параметры:
//  ВнешнийИсточник - ПланыВидовХарактеристик.ВнешниеИсточникиСсылка - идентификатор топика Kafka
// Возвращаемое значение:
//  Сообщение - Строка - Элемент из массива ответа Kafka, содержащий текст сообщения
Функция ОбработкаВходящегоСообщения(ВнешнийИсточник) Экспорт
	
	КафкаКлиент = Обработки.KafkaClient.Создать();
	МассивОтвета = КафкаКлиент.РезультатЧтенияСообщенияПоВнешнемуИсточнику(ВнешнийИсточник);
	РегистрыСведений.ЖурналВходящихСообщенийKafka.Добавить(ВнешнийИсточник,
											МассивОтвета[1],
											МассивОтвета[2],
											МассивОтвета[3]);
	Возврат МассивОтвета[2];
КонецФункции

// Записывает ошибку в РС к отправке в Kafka
// Параметры:
//  СтруктураСообщения - Структура - Имеет свойства:
//   - MessageInfo - Структура блока сообщения MessageInfo;
//   - Data - Структура блока сообщения Data
//   - Ключ - Ключ сообщения
Процедура ОтправитьОшибкуОбработки(СтруктураСообщения) Экспорт
	ТопикОшибок = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaError;
	Сообщение = РаботаСJSON.ТекстСообщенияJSON(СтруктураСообщения.MessageInfo, СтруктураСообщения.Data);
	ПоместитьСообщениеВРегистрКОтправке(ТопикОшибок, СтруктураСообщения.Ключ, Сообщение);
КонецПроцедуры

Процедура ОтправитьОтвет(ВнешнийИсточник, сткОтвет) Экспорт
	
	сткОтвет.MessageInfo.ParentMessageId = сткОтвет.MessageInfo.MessageId;
	сткОтвет.MessageInfo.MessageId = Строка(Новый УникальныйИдентификатор);
	сткОтвет.MessageInfo.ActionType = "UPD";
	сткОтвет.MessageInfo.SystemSource = "Depo";
	сткОтвет.MessageInfo.DateTimeCreate = ЗаписатьДатуJSON(ТекущаяДатаСеанса(), ФорматДатыJSON.ISO);
	Сообщение = РаботаСJSON.ТекстСообщенияJSON(сткОтвет.MessageInfo, сткОтвет.Data);
	ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, сткОтвет.MessageInfo.MessageType, Сообщение, , сткОтвет.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейсKafka

// Создает нового подписчика для чтения сообщения топика
// Параметры:
//  Соединение - COM-объект - сооединение с Kafka.
//  Параметры - Структура - содержащая параметры соединения.
Процедура СоздатьПодписчика(Соединение, Параметры) Экспорт
	
	SASL = ПараметрыПодключенияSASL(Параметры);
	ОписаниеОшибки = "";
	Попытка
		Соединение.ConsumerCreate(
			Параметры.KafkaАдрес,
			Параметры.KafkaТопик,
			Параметры.KafkaПодписчик,
			Параметры.KafkaПользователь,
			Параметры.KafkaПароль,
			Параметры.KafkaСертификат,
			SASL.saslMechanism,
			SASL.securityProtocol);
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВыполнитьЛогированиеНовыйПодписчик(Параметры.ВнешнийИсточник,
											Параметры.KafkaПодписчик,
											Параметры.KafkaТопик,
											Параметры.KafkaАдрес,
											ОписаниеОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Возвращает сообщение
// Параметры:
//  Соединение - COM-объект - сооединение с Kafka.
//  Параметры - Структура - содержащая параметры соединения.
// Возвращаемое значение:
//  Сообщение
Функция РезультатЧтенияСообщения(Соединение, Параметры) Экспорт

	ОписаниеОшибки = "";
	Попытка
		Сообщение = Соединение.Consume();
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВыполнитьЛогированиеПолучитьСообщение(Параметры.ВнешнийИсточник,
												Параметры.KafkaПодписчик,
												Параметры.KafkaТопик,
												Параметры.KafkaАдрес,
												ОписаниеОшибки);
	КонецПопытки;
	
	Возврат Сообщение;
	
КонецФункции

// Удаляет подписчика после окончания чтения
// Параметры:
//  Соединение - COM-объект - сооединение с Kafka.
//  Параметры - Структура - содержащая параметры соединения.
Процедура УдалитьПодписчика(Соединение, Параметры) Экспорт
	
	ОписаниеОшибки = "";
	Попытка
		Соединение.ConsumeClose();
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВыполнитьЛогированиеУдалитьПодписчика(Параметры.ВнешнийИсточник,
												Параметры.KafkaПодписчик,
												Параметры.KafkaТопик,
												Соединение,
												ОписаниеОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Создает нового отправителя сообщения
// Параметры:
//  Соединение - COM-объект - сооединение с Kafka.
//  Параметры - Структура - содержащая параметры соединения
Процедура СоздатьОтправителя(Соединение, Параметры) Экспорт
	
	SASL = ПараметрыПодключенияSASL(Параметры);
	ОписаниеОшибки = "";
	Попытка
		Соединение.ProducerCreate(
			Параметры.KafkaАдрес,
			Параметры.KafkaПользователь,
			Параметры.KafkaПароль,
			Параметры.KafkaСертификат,
			SASL.saslMechanism,
			SASL.securityProtocol);
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВыполнитьЛогированиеНовыйОтправитель(Параметры.ВнешнийИсточник, Параметры.KafkaАдрес, ОписаниеОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Отправляет сообщение в топик
// Параметры:
//  Соединение - COM-объект - сооединение с Kafka.
//  Параметры - Структура - содержащая параметры соединения, ключ и текст сообщения
// Возвращаемое значение:
//  РезультатОтправкиСообщения
Функция РезультатОтправкиСообщения(Соединение, Параметры) Экспорт
	
	Попытка
		Ответ = Соединение.SendProducer(Параметры.KafkaТопик, Параметры.КлючСообщения, Параметры.ТекстСообщения);
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВыполнитьЛогированиеОтправитьСообщения(Параметры.ВнешнийИсточник,
												Параметры.KafkaТопик,
												Параметры.KafkaАдрес,
												ОписаниеОшибки);
		Ответ = ОписаниеОшибки;
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Удаляет отправителя после отправки сообщения
// Параметры:
//  Соединение - COM-объект - сооединение с Kafka.
//  Параметры - Структура - содержащая параметры соединения.
Процедура УдалитьОтправителя(Соединение, Параметры) Экспорт
	
	Попытка
		Соединение.ProducerClose();
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВыполнитьЛогированиеУдалитьОтправителя(Параметры.ВнешнийИсточник, Параметры.KafkaАдрес, ОписаниеОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Извлекает тип сообщения из ключа сообщения Kafka
// Параметры:
//  Ключ - Строка - Ожидаем или уникальный ключ в формате MessageType:guid (Пример: TicketStatus:87835758-7beb-4b9c-9a1a-8d6c800d3dea)
// 					или не уникальный в формате MessageType (Пример: TicketStatus).
// Возвращаемое значение:
//  Строка
Функция ТипСообщенияИзКлючаСообщения(Ключ) Экспорт
	
	ПозицияДвоеточия = СтрНайти(Ключ, ":");
	Если ПозицияДвоеточия > 0 Тогда
		ТипСообщения = Лев(Ключ, ПозицияДвоеточия - 1);
	Иначе
		ТипСообщения = Ключ;
	КонецЕсли;
	
	Возврат ТипСообщения;
КонецФункции

#КонецОбласти

#Область Логирование

Процедура ВыполнитьЛогированиеНовыйПодписчик(Знач ВнешнийИсточник, Знач Подписчик, Знач Топик, Знач СтрокаСоединения, Знач ОписаниеОшибки)
	
	ОписаниеОшибки = "Новый подписчик: " + Подписчик + "; Топик: " + Топик
		+ Символы.ПС + СтрокаСоединения + Символы.ПС + ОписаниеОшибки;
	РегистрыСведений.ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.Добавить(ВнешнийИсточник, ОписаниеОшибки); 

КонецПроцедуры

Процедура ВыполнитьЛогированиеУдалитьПодписчика(Знач ВнешнийИсточник, Знач Подписчик, Знач Топик, Знач СтрокаСоединения, Знач ОписаниеОшибки)

	ОписаниеОшибки = "Удаление подписчика: " + Подписчик + "; Топик: " + Топик
		+ Символы.ПС + СтрокаСоединения + Символы.ПС + ОписаниеОшибки;
	РегистрыСведений.ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.Добавить(ВнешнийИсточник, ОписаниеОшибки); 

КонецПроцедуры

Процедура ВыполнитьЛогированиеНовыйОтправитель(Знач ВнешнийИсточник, Знач СтрокаСоединения, Знач ОписаниеОшибки)
		
	ОписаниеОшибки = "Новый отправитель" + Символы.ПС + СтрокаСоединения + Символы.ПС + ОписаниеОшибки;
	РегистрыСведений.ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.Добавить(ВнешнийИсточник, ОписаниеОшибки); 

КонецПроцедуры

Процедура ВыполнитьЛогированиеУдалитьОтправителя(Знач ВнешнийИсточник, Знач СтрокаСоединения, Знач ОписаниеОшибки)
	
	ОписаниеОшибки = "Удаление отправителя" + Символы.ПС + СтрокаСоединения + Символы.ПС + ОписаниеОшибки;
	РегистрыСведений.ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.Добавить(ВнешнийИсточник, ОписаниеОшибки); 

КонецПроцедуры

Процедура ВыполнитьЛогированиеПолучитьСообщение(Знач ВнешнийИсточник, Знач Подписчик, Знач Топик, Знач СтрокаСоединения, Знач ОписаниеОшибки)
	
	ОписаниеОшибки = "Чтение сообщения подписчиком: " + Подписчик + "; Топик: " + Топик
		+ Символы.ПС + СтрокаСоединения + Символы.ПС + ОписаниеОшибки;
	РегистрыСведений.ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.Добавить(ВнешнийИсточник, ОписаниеОшибки); 

КонецПроцедуры

Процедура ВыполнитьЛогированиеОтправитьСообщения(Знач ВнешнийИсточник, Знач Топик, Знач СтрокаСоединения, Знач ОписаниеОшибки)
	
	ОписаниеОшибки = "Отправка сообщения в топик: " + Топик	+ Символы.ПС + СтрокаСоединения + Символы.ПС + ОписаниеОшибки;
	РегистрыСведений.ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.Добавить(ВнешнийИсточник, ОписаниеОшибки); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыПодключенияSASL(Параметры)
	ПараметрыSASL = Новый Структура("saslMechanism,securityProtocol", -1, -1);
	Если ЗначениеЗаполнено(Параметры.KafkaПользователь) И ЗначениеЗаполнено(Параметры.KafkaСертификат) Тогда
		ПараметрыSASL.saslMechanism = ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("28.saslMechanism", 1);
		ПараметрыSASL.securityProtocol = ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("28.securityProtocol", 3);
	КонецЕсли;
	Возврат ПараметрыSASL;
КонецФункции

#КонецОбласти
